; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	infrared0 - mode
	thermograph1 - mode
	thermograph2 - mode
	thermograph3 - mode
	GroundStation4 - direction
	Star6 - direction
	Star5 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
	Planet13 - direction
	Star14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 thermograph1)
	(supports instrument1 thermograph2)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 Star5)
	(supports instrument2 thermograph3)
	(supports instrument2 infrared0)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument3 thermograph2)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 GroundStation0)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 GroundStation0)
	(calibration_target instrument6 GroundStation2)
	(supports instrument7 thermograph3)
	(calibration_target instrument7 GroundStation2)
	(calibration_target instrument7 GroundStation1)
	(supports instrument8 infrared0)
	(supports instrument8 thermograph1)
	(supports instrument8 thermograph2)
	(calibration_target instrument8 GroundStation2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star6)
)
(:goal (and
	(pointing satellite0 GroundStation3)
	(have_image Star7 thermograph2)
	(have_image Planet8 thermograph3)
	(have_image Star9 thermograph3)
	(have_image Phenomenon10 thermograph2)
	(have_image Planet11 thermograph2)
	(have_image Star12 thermograph3)
	(have_image Planet13 thermograph1)
	(have_image Star14 thermograph1)
	(have_image Phenomenon15 thermograph3)
))

)

; plan
1. (turn_to satellite0 star5 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star5)
   goals met: 0 of 10
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 10
3. (calibrate satellite0 instrument1 star5)
   added: (calibrated instrument1)
   goals met: 0 of 10
4. (turn_to satellite0 planet13 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet13)
   goals met: 0 of 10
5. (take_image satellite0 planet13 instrument1 thermograph1)
   added: (have_image planet13 thermograph1)
   goals met: 1 of 10
6. (turn_to satellite0 planet11 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet11)
   goals met: 1 of 10
7. (take_image satellite0 planet11 instrument1 thermograph2)
   added: (have_image planet11 thermograph2)
   goals met: 2 of 10
8. (turn_to satellite0 phenomenon15 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon15)
   goals met: 2 of 10
9. (take_image satellite0 phenomenon15 instrument1 thermograph3)
   added: (have_image phenomenon15 thermograph3)
   goals met: 3 of 10
10. (turn_to satellite0 phenomenon10 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 10
11. (take_image satellite0 phenomenon10 instrument1 thermograph2)
   added: (have_image phenomenon10 thermograph2)
   goals met: 4 of 10
12. (turn_to satellite0 planet8 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet8)
   goals met: 4 of 10
13. (take_image satellite0 planet8 instrument1 thermograph3)
   added: (have_image planet8 thermograph3)
   goals met: 5 of 10
14. (turn_to satellite0 star12 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star12)
   goals met: 5 of 10
15. (take_image satellite0 star12 instrument1 thermograph3)
   added: (have_image star12 thermograph3)
   goals met: 6 of 10
16. (turn_to satellite0 star14 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star14)
   goals met: 6 of 10
17. (take_image satellite0 star14 instrument1 thermograph1)
   added: (have_image star14 thermograph1)
   goals met: 7 of 10
18. (turn_to satellite0 star7 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star7)
   goals met: 7 of 10
19. (take_image satellite0 star7 instrument1 thermograph2)
   added: (have_image star7 thermograph2)
   goals met: 8 of 10
20. (turn_to satellite0 star9 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star9)
   goals met: 8 of 10
21. (take_image satellite0 star9 instrument1 thermograph3)
   added: (have_image star9 thermograph3)
   goals met: 9 of 10
22. (turn_to satellite0 groundstation3 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation3)
   goals met: 10 of 10
